{
    "MPC_destroyMissileCarrier":{

		"trigger_player_minLevel": 10,
		"trigger_min_fleet_size": 100,

		"trigger_playerRelationship_atLeast": { # Default: no values. This job will require the player to have the specified relationship or HIGHER with the specified faction(s).
			"hegemony":-0.2
		},

		"job_name":"Missile-sweeper",
		"job_description":"You've been contacted via long-range FTL transmission by a Hegemony special agent, claiming to be INTSEC.\n\n\"$PlayerName? Good. I will keep this brief. A long-ranged patrol has confirmed the existence of an autonomous ==ship-borne strategic weapon system== in ==$system==, a known ==autoship hotspot==.\" A image is promptly sent to your display - what appears to be a massive ==cruise missile== careening towards the backside of a Lasher-class frigate, which burns away in desperate speed.\n\"Ahem. This is officially considered a minor threat - it cannot target out of its system - however, MILCOM is getting ancy, and a few generals want this thing gone and swept under the rug. So. Provided combat footage of the weapon's destruction, I am authorized to release a payment of ==$reward==, and additionally, a ==rare item== installable in various colony industries to boost their performance. Best used in our own worlds - but we need good incentive for you. Interested?\"\n\nThe target is likely hardened and surrounded by Ordos. Besides that, the agent sent you a threat analysis of the weapon - your fleet will likely be ==fired upon== if your sensor profile is too high, regardless of distance. Said missiles were also found to have ==great effect== on the scout fleet - and likely, yours as well.",
		"job_intel_success":"The missile carrier now lies burning in space, reduced to scrap. Appreciation for your work is shown in the form of an instant ==$reward== transmission and a promise for a ==colony item== to be deposited on ==Chicozmostoc==.",
		"job_intel_failure":"Good news: You have an extremely dangerous tactical weapon available to you now. Bad news: This wasn't the deal. You opt not to send the combat footage, in hopes the Hegemony won't realize - but you know, they will.",
		"job_intel_expired": "what?",

		"job_forFaction": "Hegemony",
		"job_credit_reward": 1000000,
		"job_reputation_reward": 10,
		"job_type": "destruction",
		"job_show_fleet": "none",
		"job_show_distance": "system",
		"job_difficultyDescription": "The target is likely hardened and surrounded by Ordos. Besides that, the agent sent you a threat analysis of the weapon - your fleet will likely be ==fired upon== if your sensor profile is too high, regardless of distance. Said missiles were also found to have ==great effect== on the scout fleet - and likely, yours as well.",

	"job_conclusion_script": "MPC_remnantMissileCarrierBountyConclusion",
		"existing_target_memkey": "$MPC_remnantMissileCarrier"
	},

},
